strongercjd/STM32F207VCT6/26-SDIO/stm32f2x_sdio_sd.c
  errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);

  if (errorstatus != SD_OK)
  {
    return(errorstatus);
  }

  /*!< Send CMD55 APP_CMD with argument as card's RCA */
  SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
  SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(SD_CMD_APP_CMD);

  if (errorstatus != SD_OK)
  {
    return(errorstatus);
  }
  SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
  SDIO_DataInitStructure.SDIO_DataLength = 8;
  SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_8b;
  SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
  SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
  SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
  SDIO_DataConfig(&SDIO_DataInitStructure);


  /*!< Send ACMD51 SD_APP_SEND_SCR with argument as 0 */
  SDIO_CmdInitStructure.SDIO_Argument = 0x0;
  SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SD_APP_SEND_SCR;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(SD_CMD_SD_APP_SEND_SCR);

  if (errorstatus != SD_OK)
  {
    return(errorstatus);
  }

  while (!(SDIO->STA & (SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR)))
  {
    if (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET)
    {
      *(tempscr + index) = SDIO_ReadData();
      index++;
    }
  }

  if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
    errorstatus = SD_DATA_TIMEOUT;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
    errorstatus = SD_DATA_CRC_FAIL;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
    errorstatus = SD_RX_OVERRUN;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_STBITERR);
    errorstatus = SD_START_BIT_ERR;
    return(errorstatus);
  }

  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);

  *(pscr + 1) = ((tempscr[0] & SD_0TO7BITS) << 24) | ((tempscr[0] & SD_8TO15BITS) << 8) | ((tempscr[0] & SD_16TO23BITS) >> 8) | ((tempscr[0] & SD_24TO31BITS) >> 24);

  *(pscr) = ((tempscr[1] & SD_0TO7BITS) << 24) | ((tempscr[1] & SD_8TO15BITS) << 8) | ((tempscr[1] & SD_16TO23BITS) >> 8) | ((tempscr[1] & SD_24TO31BITS) >> 24);

  return(errorstatus);
}

/**
  * @brief  Converts the number of bytes in power of two and returns the power.
  * @param  NumberOfBytes: number of bytes.
  * @retval None
  */
uint8_t convert_from_bytes_to_power_of_two(uint16_t NumberOfBytes)
{
  uint8_t count = 0;

  while (NumberOfBytes != 1)
  {
    NumberOfBytes >>= 1;
    count++;
  }
  return(count);
}

/**
  * @brief  从指定扇区位置读取数据.
  * @param  buf: 数据指针.
  * @param  sector: 读取数据的起始扇区.
  * @param  sec_num: 读取的扇区个数.
  * @retval None
*/
uint8_t SD_ReadDisk(uint8_t*buf,uint32_t sector,uint32_t sec_num)
{
  uint8_t sta=SD_OK;
  uint32_t n;
  uint32_t addr;
  SD_Error Status = SD_OK;
  
  addr = sector<<9;
  if((uint32_t)buf%4!=0)
  {
    for(n=0;n<sec_num;n++)
    {
      sta=SD_ReadBlock(SDIO_DATA_BUFFER,addr+512*n,512);//单个sector的读操作
      memcpy(buf,SDIO_DATA_BUFFER,512);
      buf+=512;
      /* Check if the Transfer is finished */
      Status = SD_WaitReadOperation();
      while(SD_GetStatus() != SD_TRANSFER_OK);
    } 
  }else
  {
    if(sec_num==1)
      sta=SD_ReadBlock(buf,addr,512);    	//单个sector的读操作
    else 
      sta=SD_ReadMultiBlocks(buf,addr,512,sec_num);//多个sector  
    /* Check if the Transfer is finished */
    Status = SD_WaitReadOperation();
    while(SD_GetStatus() != SD_TRANSFER_OK);
  }
  return sta;
}
/**
  * @brief  从指定扇区位置写入数据.
  * @param  buf: 数据指针.
  * @param  sector: 写入数据的起始扇区.
  * @param  sec_num: 写入的扇区个数.
  * @retval None
  */
uint8_t SD_WriteDisk(uint8_t*buf,uint32_t sector,uint32_t sec_num)
{
  uint8_t sta=SD_OK;
  uint32_t n;
  uint32_t addr;
  SD_Error Status = SD_OK;
  
  addr = sector<<9;
  if((uint32_t)buf%4!=0)
  {
    for(n=0;n<sec_num;n++)
    {
      memcpy(SDIO_DATA_BUFFER,buf,512);
      sta=SD_WriteBlock(SDIO_DATA_BUFFER,addr+512*n,512);//单个sector的写操作
      buf+=512;
      /* Check if the Transfer is finished */
      Status = SD_WaitWriteOperation();
      while(SD_GetStatus() != SD_TRANSFER_OK);
    } 
  }else
  {
    if(sec_num==1)
      sta=SD_WriteBlock(buf,addr,512);    	//单个sector的写操作
    else 
      sta=SD_WriteMultiBlocks(buf,addr,512,sec_num);	//多个sector  
    /* Check if the Transfer is finished */
    Status = SD_WaitWriteOperation();
    while(SD_GetStatus() != SD_TRANSFER_OK);
  }
  return sta;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */  

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
